memtier/energy/data/pi4/none.out
4         Threads
50        Connections per thread
320000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         3054.87          ---          ---         6.31152         5.24700        18.94300        26.62300       208.49 
Gets        30548.60        64.80     30483.80         6.30311         5.24700        18.94300        26.49500       776.24 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      33603.47        64.80     30483.80         6.30388         5.24700        18.94300        26.49500       984.73 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.143        0.000
SET       1.935        5.000
SET       2.335       10.000
SET       2.703       15.000
SET       3.119       20.000
SET       3.615       25.000
SET       3.967       30.000
SET       4.191       35.000
SET       4.671       40.000
SET       5.023       45.000
SET       5.247       50.000
SET       5.439       52.500
SET       5.791       55.000
SET       6.015       57.500
SET       6.175       60.000
SET       6.303       62.500
SET       6.591       65.000
SET       6.975       67.500
SET       7.167       70.000
SET       7.327       72.500
SET       7.807       75.000
SET       8.031       76.250
SET       8.159       77.500
SET       8.319       78.750
SET       8.511       80.000
SET       8.895       81.250
SET       9.151       82.500
SET       9.471       83.750
SET       9.919       85.000
SET      10.367       86.250
SET      10.879       87.500
SET      11.135       88.125
SET      11.391       88.750
SET      11.647       89.375
SET      11.967       90.000
SET      12.223       90.625
SET      12.607       91.250
SET      12.991       91.875
SET      13.375       92.500
SET      13.823       93.125
SET      14.271       93.750
SET      14.527       94.062
SET      14.783       94.375
SET      15.039       94.688
SET      15.231       95.000
SET      15.487       95.312
SET      15.679       95.625
SET      15.871       95.938
SET      16.063       96.250
SET      16.319       96.562
SET      16.511       96.875
SET      16.639       97.031
SET      16.767       97.188
SET      16.895       97.344
SET      17.023       97.500
SET      17.151       97.656
SET      17.279       97.812
SET      17.407       97.969
SET      17.535       98.125
SET      17.791       98.281
SET      17.919       98.438
SET      18.047       98.516
SET      18.175       98.594
SET      18.303       98.672
SET      18.431       98.750
SET      18.559       98.828
SET      18.687       98.906
SET      18.943       98.984
SET      19.199       99.062
SET      19.455       99.141
SET      19.839       99.219
SET      20.095       99.258
SET      20.351       99.297
SET      20.607       99.336
SET      20.735       99.375
SET      20.991       99.414
SET      21.375       99.453
SET      21.631       99.492
SET      21.887       99.531
SET      22.271       99.570
SET      22.655       99.609
SET      22.911       99.629
SET      23.039       99.648
SET      23.295       99.668
SET      23.551       99.688
SET      23.679       99.707
SET      23.935       99.727
SET      24.063       99.746
SET      24.319       99.766
SET      24.575       99.785
SET      24.831       99.805
SET      24.959       99.814
SET      25.215       99.824
SET      25.343       99.834
SET      25.471       99.844
SET      25.599       99.854
SET      25.855       99.863
SET      25.983       99.873
SET      26.239       99.883
SET      26.367       99.893
SET      26.623       99.902
SET      26.751       99.907
SET      26.879       99.912
SET      27.007       99.917
SET      27.135       99.922
SET      27.391       99.927
SET      27.519       99.932
SET      27.647       99.937
SET      27.903       99.941
SET      28.159       99.946
SET      28.415       99.951
SET      28.543       99.954
SET      28.671       99.956
SET      28.927       99.958
SET      29.183       99.961
SET      29.439       99.963
SET      29.695       99.966
SET      30.079       99.968
SET      30.463       99.971
SET      30.847       99.973
SET      31.231       99.976
SET      31.359       99.977
SET      31.615       99.978
SET      31.871       99.979
SET      32.127       99.980
SET      32.255       99.982
SET      32.511       99.983
SET      32.767       99.984
SET      33.023       99.985
SET      33.279       99.987
SET      33.535       99.988
SET      33.791       99.988
SET      33.791       99.989
SET      34.047       99.990
SET      34.303       99.990
SET      34.303       99.991
SET      34.559       99.991
SET      34.559       99.992
SET      34.815       99.993
SET      35.071       99.993
SET      35.327       99.994
SET      35.327       99.994
SET      35.583       99.995
SET      35.583       99.995
SET      35.839       99.995
SET      35.839       99.995
SET      36.095       99.996
SET      36.607       99.996
SET      36.607       99.996
SET      36.863       99.997
SET      37.119       99.997
SET      37.119       99.997
SET      37.375       99.997
SET      37.631       99.997
SET      37.631       99.998
SET      37.887       99.998
SET      38.399       99.998
SET      38.911       99.998
SET      39.167       99.998
SET      39.935       99.998
SET      40.959       99.998
SET      41.727       99.999
SET      41.727       99.999
SET      41.983       99.999
SET      42.239       99.999
SET      43.263       99.999
SET      44.287       99.999
SET      45.567       99.999
SET      46.847       99.999
SET      47.871       99.999
SET      48.639       99.999
SET      48.895       99.999
SET      49.151       99.999
SET      49.663       99.999
SET      50.175       99.999
SET      50.175       99.999
SET      50.431       99.999
SET      50.943      100.000
SET      51.199      100.000
SET      51.455      100.000
SET      51.967      100.000
SET      52.223      100.000
SET      52.223      100.000
SET      52.479      100.000
SET      52.735      100.000
SET      52.735      100.000
SET      53.503      100.000
SET      53.503      100.000
SET      54.271      100.000
SET      54.783      100.000
SET      55.295      100.000
SET      55.551      100.000
SET      55.551      100.000
SET      55.551      100.000
SET      56.063      100.000
SET      56.063      100.000
SET      56.575      100.000
SET      56.575      100.000
SET      56.831      100.000
SET      56.831      100.000
SET      58.111      100.000
SET      58.111      100.000
SET      58.111      100.000
[...]
SET      58.367      100.000
SET      58.367      100.000
SET      58.367      100.000
[...]
SET      59.135      100.000
SET      59.135      100.000
SET      59.135      100.000
[...]
SET      59.391      100.000
SET      59.391      100.000
---
GET       0.135        0.000
GET       1.927        5.000
GET       2.319       10.000
GET       2.703       15.000
GET       3.119       20.000
GET       3.599       25.000
GET       3.951       30.000
GET       4.191       35.000
GET       4.671       40.000
GET       5.023       45.000
GET       5.247       50.000
GET       5.439       52.500
GET       5.791       55.000
GET       6.015       57.500
GET       6.175       60.000
GET       6.303       62.500
GET       6.591       65.000
GET       6.975       67.500
GET       7.135       70.000
GET       7.327       72.500
GET       7.775       75.000
GET       8.031       76.250
GET       8.159       77.500
GET       8.319       78.750
GET       8.447       80.000
GET       8.831       81.250
GET       9.151       82.500
GET       9.471       83.750
GET       9.919       85.000
GET      10.367       86.250
GET      10.879       87.500
GET      11.135       88.125
GET      11.391       88.750
GET      11.647       89.375
GET      11.903       90.000
GET      12.223       90.625
GET      12.607       91.250
GET      12.927       91.875
GET      13.375       92.500
GET      13.823       93.125
GET      14.271       93.750
GET      14.527       94.062
GET      14.783       94.375
GET      14.975       94.688
GET      15.231       95.000
GET      15.487       95.312
GET      15.679       95.625
GET      15.871       95.938
GET      16.063       96.250
GET      16.319       96.562
GET      16.511       96.875
GET      16.639       97.031
GET      16.767       97.188
GET      16.895       97.344
GET      17.023       97.500
GET      17.151       97.656
GET      17.279       97.812
GET      17.407       97.969
GET      17.535       98.125
GET      17.791       98.281
GET      17.919       98.438
GET      18.047       98.516
GET      18.175       98.594
GET      18.175       98.672
GET      18.431       98.750
GET      18.559       98.828
GET      18.687       98.906
GET      18.943       98.984
GET      19.199       99.062
GET      19.455       99.141
GET      19.839       99.219
GET      20.095       99.258
GET      20.351       99.297
GET      20.607       99.336
GET      20.863       99.375
GET      21.119       99.414
GET      21.375       99.453
GET      21.631       99.492
GET      21.887       99.531
GET      22.271       99.570
GET      22.655       99.609
GET      22.911       99.629
GET      23.039       99.648
GET      23.295       99.668
GET      23.551       99.688
GET      23.679       99.707
GET      23.935       99.727
GET      24.063       99.746
GET      24.319       99.766
GET      24.575       99.785
GET      24.831       99.805
GET      24.959       99.814
GET      25.087       99.824
GET      25.343       99.834
GET      25.471       99.844
GET      25.599       99.854
GET      25.727       99.863
GET      25.983       99.873
GET      26.111       99.883
GET      26.367       99.893
GET      26.623       99.902
GET      26.751       99.907
GET      26.879       99.912
GET      27.007       99.917
GET      27.135       99.922
GET      27.263       99.927
GET      27.391       99.932
GET      27.647       99.937
GET      27.775       99.941
GET      28.031       99.946
GET      28.287       99.951
GET      28.415       99.954
GET      28.543       99.956
GET      28.799       99.958
GET      28.927       99.961
GET      29.183       99.963
GET      29.567       99.966
GET      29.823       99.968
GET      30.207       99.971
GET      30.591       99.973
GET      31.103       99.976
GET      31.231       99.977
GET      31.487       99.978
GET      31.615       99.979
GET      31.871       99.980
GET      32.127       99.982
GET      32.383       99.983
GET      32.639       99.984
GET      33.023       99.985
GET      33.023       99.987
GET      33.279       99.988
GET      33.535       99.988
GET      33.791       99.989
GET      33.791       99.990
GET      34.047       99.990
GET      34.047       99.991
GET      34.303       99.991
GET      34.559       99.992
GET      34.559       99.993
GET      34.815       99.993
GET      35.071       99.994
GET      35.071       99.994
GET      35.327       99.995
GET      35.327       99.995
GET      35.583       99.995
GET      35.583       99.995
GET      35.839       99.996
GET      36.095       99.996
GET      36.351       99.996
GET      36.607       99.997
GET      36.863       99.997
GET      36.863       99.997
GET      37.119       99.997
GET      37.119       99.997
GET      37.375       99.998
GET      37.631       99.998
GET      37.887       99.998
GET      38.143       99.998
GET      38.399       99.998
GET      38.911       99.998
GET      39.679       99.998
GET      39.935       99.999
GET      40.447       99.999
GET      40.959       99.999
GET      41.471       99.999
GET      42.239       99.999
GET      43.007       99.999
GET      44.031       99.999
GET      44.799       99.999
GET      45.567       99.999
GET      46.847       99.999
GET      47.359       99.999
GET      47.871       99.999
GET      48.383       99.999
GET      48.639       99.999
GET      49.151       99.999
GET      49.407       99.999
GET      49.919      100.000
GET      50.175      100.000
GET      50.687      100.000
GET      50.943      100.000
GET      51.455      100.000
GET      51.711      100.000
GET      51.967      100.000
GET      52.223      100.000
GET      52.479      100.000
GET      52.735      100.000
GET      52.991      100.000
GET      53.503      100.000
GET      54.271      100.000
GET      54.527      100.000
GET      54.783      100.000
GET      55.039      100.000
GET      55.295      100.000
GET      55.551      100.000
GET      55.807      100.000
GET      56.319      100.000
GET      56.575      100.000
GET      56.831      100.000
GET      57.087      100.000
GET      57.343      100.000
GET      57.599      100.000
GET      57.599      100.000
GET      57.855      100.000
GET      58.111      100.000
GET      58.111      100.000
GET      58.367      100.000
GET      58.367      100.000
GET      58.367      100.000
GET      58.623      100.000
GET      58.623      100.000
GET      58.879      100.000
GET      58.879      100.000
GET      58.879      100.000
GET      59.135      100.000
GET      59.135      100.000
GET      59.391      100.000
GET      59.391      100.000
GET      59.647      100.000
GET      59.647      100.000
GET      59.647      100.000
[...]
GET      59.903      100.000
GET      59.903      100.000
GET      59.903      100.000
[...]
GET      60.159      100.000
GET      60.671      100.000
GET      60.671      100.000
GET      60.671      100.000
GET      60.927      100.000
GET      60.927      100.000
GET      60.927      100.000
GET      63.231      100.000
GET      63.231      100.000
GET      63.231      100.000
GET      64.511      100.000
GET      64.511      100.000
GET      64.511      100.000
[...]
GET      65.023      100.000
GET      65.023      100.000
GET      65.023      100.000
[...]
GET      65.535      100.000
GET      65.535      100.000
GET      65.535      100.000
[...]
GET      67.071      100.000
GET      67.071      100.000
---
WAIT      0.000      100.000